_src/posts/2010-10-02-save-yourself2.org
# -*- coding: utf-8-unix; -*-
#+TITLE:       自作孽，不可活
#+AUTHOR:      Bruce Asu
#+EMAIL:       bruceasu@163.com
#+DATE:        <2010-10-02 20:00>
#+filetags:    linux knowledge
#+DESCRIPTION: 自作孽，不可活

#+LANGUAGE:    en
#+OPTIONS:     H:7 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

* 巧用crontab

如果你的Linux机器处于IDC机房，前端没有硬件防火墙时建议开启iptables防护；但此时就
有一个问题，你可能要在处于千里之外的公司调试iptables脚本，稍一出错后果就很严重。
我在配置一台服务器的iptables时，不小心设置了某一项错误参数，结果锁定了SSH会话，
导致我们经理及另一技术员连不上服务器。郁闷之余，看到此法特推荐给大家，极其有用，
建议大家学习参考：

可以配置一计划任务crontab, 每5分钟运行一次，即
:    */5 * * * * root /bin/sh /root/firestop.sh，

firestop.sh内容为：
:    service iptables stop；

这样即使你的脚本存在错误设置（或丢失的）规则时，也不至于将你锁在计算机外而无法返
回与计算机的连接，

让你放心大胆的调试你的脚本。同学们可参考学习下，这毕竟是生产环境下逼出来的办法。
